gyr0code/micropython/ports/stm32/adc.c
        // store value in buffer
        if (typesize == 1) {
            value >>= 4;
        }
        mp_binary_set_val_array_from_int(bufinfo.typecode, bufinfo.buf, index, value);
    }

    // turn the ADC off
    HAL_ADC_Stop(&self->handle);

    #if defined(TIM6)
    if (mp_obj_is_integer(freq_in)) {
        // stop timer if we initialised TIM6 in this function (legacy behaviour)
        HAL_TIM_Base_Stop(tim);
    }
    #endif

    return mp_obj_new_int(bufinfo.len);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(adc_read_timed_obj, adc_read_timed);

STATIC mp_obj_t adc_read_dma(mp_obj_t self_in, mp_obj_t sample_num) {

    pyb_obj_adc_t *self = MP_OBJ_TO_PTR(self_in);
    tot_samples = mp_obj_get_int(sample_num);

    totpeakNum = 0;

    for(int n = 0; n < DMA_BUFFER_SIZE; n++){
    aADCConvertedValues[n]=0;
    }
    for(int n = 0; n < NUMBER_PEAKS; n++){
    payload[n]=0;
    }

    static DMA_HandleTypeDef DMAHandle;

    dma_init(&DMAHandle, &dma_ADC_1, DMA_PERIPH_TO_MEMORY, &self->handle);

    self->handle.DMA_Handle = &DMAHandle;

    adc_config_channel(&self->handle, self->channel);

    printf("HERE\n");

    DWT_config();

    if(HAL_ADC_Start_DMA(&self->handle, (uint32_t *)aADCConvertedValues, 40) != HAL_OK){
        Error_Handler();
    }

    return mp_const_none;

}

STATIC MP_DEFINE_CONST_FUN_OBJ_2(adc_read_dma_obj, adc_read_dma);


// CAN'T READOUT INTERLEAVED MODE IN POLLING //
STATIC mp_obj_t adc_read_interleaved(mp_obj_t self_in, mp_obj_t sample_num) {

    pyb_obj_adc_t *self = MP_OBJ_TO_PTR(self_in);
    tot_samples = mp_obj_get_int(sample_num);

    totpeakNum = 0;

    for(int n = 0; n < DMA_BUFFER_SIZE; n++){
    aADCConvertedValues[n]=0;
    }
    for(int n = 0; n < NUMBER_PEAKS; n++){
    payload[n]=0;
    }

    // configure + link DMA
    static DMA_HandleTypeDef DMAHandle;
    dma_init(&DMAHandle, &dma_ADC_1, DMA_PERIPH_TO_MEMORY, &self->handle);
    self->handle.DMA_Handle = &DMAHandle;

    // configure the three ADC channels
    adc_config_channel(&self->handle, self->channel);
    adc_config_channel(&self->handle2, self->channel);
    adc_config_channel(&self->handle3, self->channel);
    
    // configure the interleaved adc mode
    ADC_MultiModeTypeDef mode;
    mode.Mode = ADC_TRIPLEMODE_INTERL;
    mode.DMAAccessMode = ADC_DMAACCESSMODE_2;
    mode.TwoSamplingDelay = ADC_TWOSAMPLINGDELAY_5CYCLES;
    
    // link to ADC1 master ADC
    if (HAL_ADCEx_MultiModeConfigChannel(&self->handle, &mode) != HAL_OK) {
        /* Multimode Configuration Error */
        Error_Handler();
    }

    if (HAL_ADC_Start(&self->handle3) != HAL_OK) {
        Error_Handler();
    }

    if (HAL_ADC_Start(&self->handle2) != HAL_OK) {
        Error_Handler();
    }

    DWT_config();

    // Start triple interleaved mode with ADC1
    if (HAL_ADCEx_MultiModeStart_DMA(&self->handle, (uint32_t *)aADCConvertedValues, 40) != HAL_OK) {
        Error_Handler();
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(adc_read_interleaved_obj, adc_read_interleaved);

STATIC mp_obj_t adc_deinit_setup(mp_obj_t self_in){
    pyb_obj_adc_t *self = MP_OBJ_TO_PTR(self_in);
    
    if(self->tri_mode){
        // Stop the ADCs
        HAL_ADC_Stop(&self->handle2);
        HAL_ADC_Stop(&self->handle3);
        // Deinit ADC peripherals
        HAL_ADC_DeInit(&self->handle2);
        HAL_ADC_DeInit(&self->handle3);
        // Disable the ADC clocks
        __HAL_RCC_ADC2_CLK_DISABLE();
        __HAL_RCC_ADC3_CLK_DISABLE();
    }

    HAL_ADC_DeInit(&self->handle);
    __HAL_RCC_ADC1_CLK_DISABLE();

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(adc_deinit_setup_obj, adc_deinit_setup);

// read_timed_multi((adcx, adcy, ...), (bufx, bufy, ...), timer)
//
// Read analog values from multiple ADC's into buffers at a rate set by the
// timer.  The ADC values have 12-bit resolution and are stored directly into
// the corresponding buffer if its element size is 16 bits or greater, otherwise
// the sample resolution will be reduced to 8 bits.
//
// This function should not allocate any heap memory.
STATIC mp_obj_t adc_read_timed_multi(mp_obj_t adc_array_in, mp_obj_t buf_array_in, mp_obj_t tim_in) {
    size_t nadcs, nbufs;
    mp_obj_t *adc_array, *buf_array;
    mp_obj_get_array(adc_array_in, &nadcs, &adc_array);
    mp_obj_get_array(buf_array_in, &nbufs, &buf_array);

    if (nadcs < 1) {
        mp_raise_ValueError("need at least 1 ADC");
    }
    if (nadcs != nbufs) {
        mp_raise_ValueError("length of ADC and buffer lists differ");
    }

    // Get buf for first ADC, get word size, check other buffers match in type
    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(buf_array[0], &bufinfo, MP_BUFFER_WRITE);
    size_t typesize = mp_binary_get_size('@', bufinfo.typecode, NULL);
    void *bufptrs[nbufs];
    for (uint array_index = 0; array_index < nbufs; array_index++) {
        mp_buffer_info_t bufinfo_curr;
        mp_get_buffer_raise(buf_array[array_index], &bufinfo_curr, MP_BUFFER_WRITE);
        if ((bufinfo.len != bufinfo_curr.len) || (bufinfo.typecode != bufinfo_curr.typecode)) {
            mp_raise_ValueError("size and type of buffers must match");
        }
        bufptrs[array_index] = bufinfo_curr.buf;
    }

    // Use the supplied timer object as the sampling time base
    TIM_HandleTypeDef *tim;
    tim = pyb_timer_get_handle(tim_in);

    // Start adc; this is slow so wait for it to start
    pyb_obj_adc_t *adc0 = MP_OBJ_TO_PTR(adc_array[0]);
    adc_config_channel(&adc0->handle, adc0->channel);
    HAL_ADC_Start(&adc0->handle);
    // Wait for sample to complete and discard
    adc_wait_for_eoc_or_timeout(EOC_TIMEOUT);
    // Read (and discard) value
    uint value = ADCx->DR;

    // Ensure first sample is on a timer tick
    __HAL_TIM_CLEAR_FLAG(tim, TIM_FLAG_UPDATE);
    while (__HAL_TIM_GET_FLAG(tim, TIM_FLAG_UPDATE) == RESET) {
    }
    __HAL_TIM_CLEAR_FLAG(tim, TIM_FLAG_UPDATE);

    // Overrun check: assume success
    bool success = true;
    size_t nelems = bufinfo.len / typesize;
    for (size_t elem_index = 0; elem_index < nelems; elem_index++) {
        if (__HAL_TIM_GET_FLAG(tim, TIM_FLAG_UPDATE) != RESET) {
            // Timer has already triggered
            success = false;
        } else {
            // Wait for the timer to trigger so we sample at the correct frequency
            while (__HAL_TIM_GET_FLAG(tim, TIM_FLAG_UPDATE) == RESET) {
            }
        }
        __HAL_TIM_CLEAR_FLAG(tim, TIM_FLAG_UPDATE);

        for (size_t array_index = 0; array_index < nadcs; array_index++) {
            pyb_obj_adc_t *adc = MP_OBJ_TO_PTR(adc_array[array_index]);
            // configure the ADC channel
            adc_config_channel(&adc->handle, adc->channel);
            // for the first sample we need to turn the ADC on
            // ADC is started: set the "start sample" bit
            #if defined(STM32F4) || defined(STM32F7)
            ADCx->CR2 |= (uint32_t)ADC_CR2_SWSTART;
            #elif defined(STM32F0) || defined(STM32H7) || defined(STM32L4)
            SET_BIT(ADCx->CR, ADC_CR_ADSTART);
            #else
            #error Unsupported processor
            #endif
            // wait for sample to complete
            adc_wait_for_eoc_or_timeout(EOC_TIMEOUT);

            // read value
            value = ADCx->DR;

            // store values in buffer
            if (typesize == 1) {
                value >>= 4;
            }
            mp_binary_set_val_array_from_int(bufinfo.typecode, bufptrs[array_index], elem_index, value);
        }
    }

